MIN_WEIGHT = 0.01

COURSE = "Практикум по моделированию роботизированного технологического процесса.b"

HOST = 'https://intuit.ru'
URL = 'https://intuit.ru/studies/courses/23/23/info'
URL = 'https://intuit.ru/studies/courses/46/46/info'
URL = 'https://intuit.ru/studies/courses/2264/227/info'
URL = 'https://intuit.ru/studies/courses/650/506/info'
N_VARS = 3
N_TASKS = 27

"""
"Администрирование информационных систем" 02.03.02 Фундаментальная информатика и информационные технологии (направленность : Открытые информационные системы)
ОПК.3 ^ Способен разрабатывать алгоритмические и программные решения применяя математические модели, методы и современные средства проектирования информационных и автоматизированных систем; создавать информационные ресурсы прикладных баз данных, тестов и средств тестирования систем и средств на соответствие стандартам и исходным требованиям ^ Применяет теоретические методы анализа и средства информационного моделирования для теоретического и экспериментального исследования и дальнейшего проектирования информационных и автоматизированных систем
ОПК.5 ^ Способен инсталлировать и сопровождать программное обеспечение информационных систем и баз данных с учетом информационной безопасности ^ Выполняет инсталляцию и настройку программного обеспечения
ПК.2 ^ Способность выполнять работы и управлять работами по созданию (модификации) и сопровождению информационных систем автоматизирующих задачи организационного управления и бизнес-процессы ^ Выполняет работы по проектированию и сопровождению информационных систем; управляет работами по модификации и управлению ИТ-инфраструктурой
ПК.3 ^ Способность применять языки, системы и инструментальные средства программирования, работать с программными средствами прикладного, системного и специализированного назначения ^ Работает с программными средствами прикладного, системного и специализированного назначения
ПК.4 ^ Способность применять методы и технологии конфигурирования информационных систем, сетевых технологий и платформенных окружений ^ Использует методы и технологии конфигурирования информационных систем, сетевых технологий и платформенных окружений; этапы внедрения, адаптации и настройки информационных систем Выполняет адаптацию и локализует программное обеспечение, проводит сборку и администрирование информационной системы Исправляет дефекты и несоответствия установки, интеграции и настройки системного и прикладного программного обеспечения; выполняет комплекс работ сопровождения и реинжиниринга
ПК.1 ^ Способность взаимодействовать и сотрудничать с профессиональными сетевыми сообществами, отслеживать динамику развития выбранных направлений области информационных технологий
ПК.12 ^ способность разрабатывать, оценивать и реализовывать процессы жизненного цикла информационных систем, программного обеспечения, сервисов информационных технологий, а также реализовывать методы и механизмы оценки и анализа функционирования средств информационных технологий
"""
"""
ФОСы в 6 вариантах по УМК 61264 (дисциплина «АДМИНИСТРИРОВАНИЕ ИНФОРМАЦИОННЫХ СИСТЕМ»);
ФОСы в 6 вариантах по УМК 83417 (дисциплина «ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ И ВЫЧИСЛИТЕЛЬНЫЕ СИСТЕМЫ»);
ФОСы в 3 вариантах для УМК 75966 (дисциплина «УПРАВЛЕНИЕ ИТ ИНФРАСТРУКТУРОЙ»);
ФОСы в 3 вариантов для УМК 75966 (дисциплина «УПРАВЛЕНИЕ ИТ ИНФРАСТРУКТУРОЙ»);
ФОС в 1 варианте для УМК 92080 (дисциплина «АНАЛИЗ ИНФОРМАЦИОННЫХ ТЕХНОЛОГИЙ»)
ФОС в 1 варианте для УМК 92082 (дисциплина «ИНТЕЛЛЕКТУАЛЬНЫЕ ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ»)"""