MIN_WEIGHT = 0.01

COURSE = "Администрирование информационных систем"
COURSE = "Информационные технологии и вычислительные системы"
#COURSE = "Управление ИТ инфраструктурой"
#COURSE = "Анализ информационных технологий"
#COURSE = "Интеллектуальные информационные технологии"

HOST = 'https://intuit.ru'
URL = '%s/studies/courses/3647/889/info' % HOST
URL = '%s/studies/courses/3574/816/info' % HOST
URL = 'https://intuit.ru/studies/courses/23/23/info'
#URL = 'https://intuit.ru/studies/courses/3609/851/info'

URL = 'https://intuit.ru/studies/curriculums/20578/info'
URL = 'https://intuit.ru/studies/courses/1055/271/info'
URL = 'https://intuit.ru/studies/courses/46/46/info'

N_VARS = 6
N_TASKS = 20

"""
"Администрирование информационных систем" 02.03.02 Фундаментальная информатика и информационные технологии (направленность : Открытые информационные системы)
ОПК.3 ^ Способен разрабатывать алгоритмические и программные решения применяя математические модели, методы и современные средства проектирования информационных и автоматизированных систем; создавать информационные ресурсы прикладных баз данных, тестов и средств тестирования систем и средств на соответствие стандартам и исходным требованиям ^ Применяет теоретические методы анализа и средства информационного моделирования для теоретического и экспериментального исследования и дальнейшего проектирования информационных и автоматизированных систем
ОПК.5 ^ Способен инсталлировать и сопровождать программное обеспечение информационных систем и баз данных с учетом информационной безопасности ^ Выполняет инсталляцию и настройку программного обеспечения
ПК.2 ^ Способность выполнять работы и управлять работами по созданию (модификации) и сопровождению информационных систем автоматизирующих задачи организационного управления и бизнес-процессы ^ Выполняет работы по проектированию и сопровождению информационных систем; управляет работами по модификации и управлению ИТ-инфраструктурой
ПК.3 ^ Способность применять языки, системы и инструментальные средства программирования, работать с программными средствами прикладного, системного и специализированного назначения ^ Работает с программными средствами прикладного, системного и специализированного назначения
ПК.4 ^ Способность применять методы и технологии конфигурирования информационных систем, сетевых технологий и платформенных окружений ^ Использует методы и технологии конфигурирования информационных систем, сетевых технологий и платформенных окружений; этапы внедрения, адаптации и настройки информационных систем Выполняет адаптацию и локализует программное обеспечение, проводит сборку и администрирование информационной системы Исправляет дефекты и несоответствия установки, интеграции и настройки системного и прикладного программного обеспечения; выполняет комплекс работ сопровождения и реинжиниринга
ПК.1 ^ Способность взаимодействовать и сотрудничать с профессиональными сетевыми сообществами, отслеживать динамику развития выбранных направлений области информационных технологий
ПК.12 ^ способность разрабатывать, оценивать и реализовывать процессы жизненного цикла информационных систем, программного обеспечения, сервисов информационных технологий, а также реализовывать методы и механизмы оценки и анализа функционирования средств информационных технологий
"""